posts/2018-09-15-thurman-on-christian-power.org
#+title: Thurman on Christian Power
#+date: <2018-09-15>
#+filetags: quotes

#+ATTR_HTML: :class bigquote
#+begin_quote
Too often the price exacted by society for security and respectability is that the Christian movement in its formal expression must be on the side of the strong against the weak. This is a matter of tremendous significance, for it reveals to what extent a religion that was born of a people acquainted with persecution and suffering has become the cornerstone of a civilization and of nations whose very position in modern life has too often been secured by a ruthless use of power applied to weak and defenseless peoples.
#+end_quote

#+ATTR_HTML: :class bigquote
Howard Thurman, /Jesus and the Disinherited/, p.11.


#+begin_tagline
Tagged: quotes
#+end_tagline
