docs/posts/2018-09-15-thurman-on-christian-power.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 29, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Thurman on Christian Power</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Thurman on Christian Power</h1>
<p class="subtitle" role="doc-subtitle">Sep 15, 2018</p>
</header><blockquote class="bigquote">
<p>
Too often the price exacted by society for security and respectability is that the Christian movement in its formal expression must be on the side of the strong against the weak. This is a matter of tremendous significance, for it reveals to what extent a religion that was born of a people acquainted with persecution and suffering has become the cornerstone of a civilization and of nations whose very position in modern life has too often been secured by a ruthless use of power applied to weak and defenseless peoples.
</p>
</blockquote>

<p class="bigquote">
Howard Thurman, <i>Jesus and the Disinherited</i>, p.11.
</p>


<div class="tagline" id="org2ea4a5a">
<p>
Tagged: <a href="../tags/quotes.html">Quotes</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 29, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
